fun main() {
    querys()
}

fun querys() {
    var res = 0
    println("""В каком году распался СССР?
        1. 1998
        2. 1988
        3. 1991
        4. 1812
    """.trimMargin())
    when(readLine()) {
        "1" -> println("Упс... Неправильно!\n")
        "2" -> println("Упс... Неправильно!\n")
        "3" -> {println("Правильно!\n")
            res += 1 }
        "4" -> println("Упс... Неправильно!\n")
    }

    println("""В каком году состоялась октябрьская революция 
        1. 1987
        2. 1891
        3. 1991
        4. 1917
    """.trimMargin())
    when(readLine()) {
        "1" -> println("Упс... Неправильно!\n")
        "2" -> println("Упс... Неправильно!\n")
        "3" -> println("Упс... Неправильно!\n")
        "4" -> {println("Правильно!\n")
            res += 1 }
    }

    println("""В каком году крестили Русь?
        1. 998
        2. 1251
        3. 988
        4. 1812
    """.trimMargin())
    when(readLine()) {
        "1" -> println("Упс... Неправильно!\n")
        "2" -> println("Упс... Неправильно!\n")
        "3" -> {println("Правильно!\n")
            res += 1 }
        "4" -> println("Упс... Неправильно!\n")
    }

    println("""В каком временном промежутке шла Вторая мировая война?
        1. 1941-1945
        2. 1939-1947
        3. 1915-1922
        4. 1975-1981
    """.trimMargin())
    when(readLine()) {
        "1" -> println("Упс... Неправильно!\n")
        "2" -> {println("Правильно!\n")
            res += 1 }
        "3" -> println("Упс... Неправильно!\n")
        "4" -> println("Упс... Неправильно!\n")
    }

    println("""Первый президент Российской Федерации?
        1. В.В. Путин 
        2. М.С. Горбачев
        3. Б.Н. Ельцин
        4. Ю.В. Андропов
    """.trimMargin())
    when(readLine()) {
        "1" -> println("Упс... Неправильно!\n")
        "2" -> println("Упс... Неправильно!\n")
        "3" -> {println("Правильно!\n")
            res += 1 }
        "4" -> println("Упс... Неправильно!\n")
    }

    when(res) {
        in 0..2 -> println("Слабо, твои познания в истории оставляют желать лучшего")
        in 3..4 -> println("неплохо, но есть куда стремиться")
        5 -> println("Отлично, история твоя стихия. Молодец!")
    }
}